#### 파일조작 , 데이터조작(문자열)
- xxxx.csv
- xxxx.excel
- xxxx.json
- xxxx.html
- scraping 비정형 데이터
- read_xxxx() , to_xxxx()

In [43]:
import numpy  as np
import pandas as pd

import warnings
warnings.filterwarnings(action='ignore')

from datetime import date, datetime, timedelta
from dateutil.parser import parse

import json
import urllib 

# titanic dataset
import seaborn as sns 

# 비정형 데이터 처리를 위한 라이브러리
from bs4 import BeautifulSoup
import requests 
import re 



print('numpy  version - ' , np.__version__)
print('pandas version - ' , pd.__version__)

numpy  version -  1.20.3
pandas version -  1.3.4

In [2]:
def seriesInfo(s) :
    print('series : index + values \n' , s) 
    print('index  - ' , s.index  , type(s.index))
    print('values - ' , s.values , type(s.values))

def frmInfo(df) :
    display('data - ' , df )
    print()
    print('shape   - ' , df.shape , df.shape[0] , df.shape[1])
    print('size    - ' , df.size )
    print('ndim    - ' , df.ndim)
    print('index   - ' , df.index    , type(df.index))
    print('columns - ' , df.columns  , type( df.columns ))
    print('values  - \n' , df.values , type(df.values) )

- read_csv() : header = , index_col =

In [3]:
tmp_frm = pd.read_csv('./pandas_data/read_csv_sample.csv')
frmInfo(tmp_frm)

'data - '

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

shape   -  (3, 4) 3 4
size    -  12
ndim    -  2
index   -  RangeIndex(start=0, stop=3, step=1) <class 'pandas.core.indexes.range.RangeIndex'>
columns -  Index(['c0', 'c1', 'c2', 'c3'], dtype='object') <class 'pandas.core.indexes.base.Index'>
values  -
 [[0 1 4 7]
 [1 2 5 8]
 [2 3 6 9]] <class 'numpy.ndarray'>

In [4]:
tmp_frm = pd.read_csv('./pandas_data/read_csv_sample.csv' , header = None)
frmInfo(tmp_frm)

'data - '

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

shape   -  (4, 4) 4 4
size    -  16
ndim    -  2
index   -  RangeIndex(start=0, stop=4, step=1) <class 'pandas.core.indexes.range.RangeIndex'>
columns -  Int64Index([0, 1, 2, 3], dtype='int64') <class 'pandas.core.indexes.numeric.Int64Index'>
values  -
 [['c0' 'c1' 'c2' 'c3']
 ['0' '1' '4' '7']
 ['1' '2' '5' '8']
 ['2' '3' '6' '9']] <class 'numpy.ndarray'>

In [8]:
tmp_frm = pd.read_csv('./pandas_data/read_csv_sample.csv' , index_col = 'c0')
frmInfo(tmp_frm)

'data - '

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

shape   -  (3, 4) 3 4
size    -  12
ndim    -  2
index   -  RangeIndex(start=0, stop=3, step=1) <class 'pandas.core.indexes.range.RangeIndex'>
columns -  Index(['c0', 'c1', 'c2', 'c3'], dtype='object') <class 'pandas.core.indexes.base.Index'>
values  -
 [[0 1 4 7]
 [1 2 5 8]
 [2 3 6 9]] <class 'numpy.ndarray'>

- read_excel()

In [15]:
tmp_frm = pd.read_excel('./pandas_data/남북한발전전력량.xlsx' , header = None )
frmInfo(tmp_frm)

'data - '

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,28
0,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
1,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
2,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
3,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
4,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
5,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
6,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
7,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
8,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
9,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

shape   -  (10, 29) 10 29
size    -  290
ndim    -  2
index   -  RangeIndex(start=0, stop=10, step=1) <class 'pandas.core.indexes.range.RangeIndex'>
columns -  Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
           dtype='int64') <class 'pandas.core.indexes.numeric.Int64Index'>
values  -
 [['전력량 (억㎾h)' '발전 전력별' '1990' '1991' '1992' '1993' '1994' '1995' '1996'
  '1997' '1998' '1999' '2000' '2001' '2002' '2003' '2004' '2005' '2006'
  '2007' '2008' '2009' '2010' '2011' '2012' '2013' '2014' '2015' '2016']
 ['남한' '합계' 1077 1186 1310 1444 1650 1847 2055 2244 2153 2393 2664 2852
  3065 3225 3421 3646 3812 4031 4224 4336 4747 4969 5096 5171 5220 5281
  5404]
 [nan '수력' 64 51 49 60 41 55 52 54 61 61 56 42 53 69 59 52 52 50 56 56 65
  78 77 84 78 58 66]
 [nan '화력' 484 573 696 803 1022 1122 1264 1420 1195 1302 1518 1689 1821
  1859 2056 2127 2272 2551 2658 2802 3196 3343 3430 3581 3427 3402 3523]
 [nan '원자력' 529 563 565 581 587 670 739 771 897 1031 1090 1121 1191 1297
  1307 1468 1487 1429 1510 1478 1486 1547 1503 1388 1564 1648 1620]
 [nan '신재생' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-'
  '-' '-' '-' '-' '-' '-' '-' 86 118 151 173 195]
 ['북한' '합계' 277 263 247 221 231 230 213 193 170 186 194 202 190 196 206
  215 225 236 255 235 237 211 215 221 216 190 239]
 [nan '수력' 156 150 142 133 138 142 125 107 102 103 102 106 106 117 125
  131 126 133 141 125 134 132 135 139 130 100 128]
 [nan '화력' 121 113 105 88 93 88 88 86 68 83 92 96 84 79 81 84 99 103 114
  110 103 79 80 82 86 90 111]
 [nan '원자력' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-'
  '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-' '-']] <class 'numpy.ndarray'>

In [14]:
tmp_frm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 29 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   전력량 (억㎾h)  2 non-null      object
 1   발전 전력별     9 non-null      object
 2   1990       9 non-null      object
 3   1991       9 non-null      object
 4   1992       9 non-null      object
 5   1993       9 non-null      object
 6   1994       9 non-null      object
 7   1995       9 non-null      object
 8   1996       9 non-null      object
 9   1997       9 non-null      object
 10  1998       9 non-null      object
 11  1999       9 non-null      object
 12  2000       9 non-null      object
 13  2001       9 non-null      object
 14  2002       9 non-null      object
 15  2003       9 non-null      object
 16  2004       9 non-null      object
 17  2005       9 non-null      object
 18  2006       9 non-null      object
 19  2007       9 non-null      object
 20  2008       9 non-null      object
 21  2009       9 non-null      object
 22  2010       9 non-null      object
 23  2011       9 non-null      object
 24  2012       9 non-null      object
 25  2013       9 non-null      object
 26  2014       9 non-null      object
 27  2015       9 non-null      object
 28  2016       9 non-null      object
dtypes: object(29)
memory usage: 2.2+ KB

- read_json()

In [17]:
tmp_frm = pd.read_json('./pandas_data/read_json_sample.json')
frmInfo(tmp_frm)

'data - '

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

shape   -  (3, 4) 3 4
size    -  12
ndim    -  2
index   -  Index(['pandas', 'NumPy', 'matplotlib'], dtype='object') <class 'pandas.core.indexes.base.Index'>
columns -  Index(['name', 'year', 'developer', 'opensource'], dtype='object') <class 'pandas.core.indexes.base.Index'>
values  -
 [['' 2008 'Wes Mckinneye' 'True']
 ['' 2006 'Travis Oliphant' 'True']
 ['' 2003 'John D. Hunter' 'True']] <class 'numpy.ndarray'>

In [18]:
tmp_frm.values

array([['', 2008, 'Wes Mckinneye', 'True'],
       ['', 2006, 'Travis Oliphant', 'True'],
       ['', 2003, 'John D. Hunter', 'True']], dtype=object)

In [19]:
tmp_frm.index.values

array(['pandas', 'NumPy', 'matplotlib'], dtype=object)

- read_html()

In [37]:
tmp_frm = pd.read_html('./pandas_data/sample.html')
print('type - ' , type(tmp_frm))
print()
tmp_frm

print()
print('len - ' , len(tmp_frm))

print()
print()
for idx in range( len(tmp_frm) ) :
    print('tables[{}]'.format(idx))
    print(tmp_frm[idx])
    print()

type -  <class 'list'>


len -  2


tables[0]
   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9

tables[1]
         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [38]:
print( 'type - ' , type( tmp_frm[0] ) )
display(tmp_frm[0])
print()
print(' columns index - ' , tmp_frm[0].columns)

print('drop - ')
tmp_frm[0].drop('Unnamed: 0' , axis = 1 , inplace = True)
display(tmp_frm[0])

type -  <class 'pandas.core.frame.DataFrame'>

   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9

 columns index -  Index(['Unnamed: 0', 'c0', 'c1', 'c2', 'c3'], dtype='object')
drop -

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [32]:
print( 'type - ' , type( tmp_frm[1] ) )
display(tmp_frm[1])

type -  <class 'pandas.core.frame.DataFrame'>

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [39]:
tmp_frm[1].set_index(['name'] , inplace = True ) 
display(tmp_frm[1])

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

- scraping 을 통한 데이터 처리
- selenium , BeautifulSop

In [46]:
response = requests.get('https://en.wikipedia.org/wiki/List_of_American_exchange-traded_funds')
print('response - \n' , type(response.text) )

response -
 <class 'str'>

In [78]:
soup = BeautifulSoup(response.text , 'html')
print( 'type - ' , type(soup))
rows = soup.select('div > ul > li')
print(' type - ' , type(rows))

# print()
print(rows)

type -  <class 'bs4.BeautifulSoup'>
 type -  <class 'bs4.element.ResultSet'>
[<li class="toclevel-1 tocsection-1"><a href="#Stock_ETFs"><span class="tocnumber">1</span> <span class="toctext">Stock ETFs</span></a>
<ul>
<li class="toclevel-2 tocsection-2"><a href="#Broad_market_ETFs"><span class="tocnumber">1.1</span> <span class="toctext">Broad market ETFs</span></a></li>
<li class="toclevel-2 tocsection-3"><a href="#Index-tracking_ETFs"><span class="tocnumber">1.2</span> <span class="toctext">Index-tracking ETFs</span></a></li>
<li class="toclevel-2 tocsection-4"><a href="#Style_ETFs"><span class="tocnumber">1.3</span> <span class="toctext">Style ETFs</span></a>
<ul>
<li class="toclevel-3 tocsection-5"><a href="#Large-cap_ETFs"><span class="tocnumber">1.3.1</span> <span class="toctext">Large-cap ETFs</span></a></li>
<li class="toclevel-3 tocsection-6"><a href="#Mid-cap_ETFs"><span class="tocnumber">1.3.2</span> <span class="toctext">Mid-cap ETFs</span></a></li>
<li class="toclevel-3 tocsection-7"><a href="#Small-cap_ETFs"><span class="tocnumber">1.3.3</span> <span class="toctext">Small-cap ETFs</span></a></li>
</ul>
</li>
<li class="toclevel-2 tocsection-8"><a href="#International_ETFs"><span class="tocnumber">1.4</span> <span class="toctext">International ETFs</span></a>
<ul>
<li class="toclevel-3 tocsection-9"><a href="#Broad_ex-US_ETFs"><span class="tocnumber">1.4.1</span> <span class="toctext">Broad ex-US ETFs</span></a></li>
<li class="toclevel-3 tocsection-10"><a href="#Regional_ex-US_ETFs"><span class="tocnumber">1.4.2</span> <span class="toctext">Regional ex-US ETFs</span></a></li>
<li class="toclevel-3 tocsection-11"><a href="#Country_ETFs"><span class="tocnumber">1.4.3</span> <span class="toctext">Country ETFs</span></a>
<ul>
<li class="toclevel-4 tocsection-12"><a href="#Developed_ex-US_markets"><span class="tocnumber">1.4.3.1</span> <span class="toctext">Developed ex-US markets</span></a></li>
<li class="toclevel-4 tocsection-13"><a href="#Emerging_markets"><span class="tocnumber">1.4.3.2</span> <span class="toctext">Emerging markets</span></a></li>
</ul>
</li>
</ul>
</li>
<li class="toclevel-2 tocsection-14"><a href="#Sector_ETFs"><span class="tocnumber">1.5</span> <span class="toctext">Sector ETFs</span></a>
<ul>
<li class="toclevel-3 tocsection-15"><a href="#US_domestic_sectors"><span class="tocnumber">1.5.1</span> <span class="toctext">US domestic sectors</span></a></li>
<li class="toclevel-3 tocsection-16"><a href="#Global_sectors"><span class="tocnumber">1.5.2</span> <span class="toctext">Global sectors</span></a></li>
</ul>
</li>
</ul>
</li>, <li class="toclevel-1 tocsection-17"><a href="#Bond_ETFs"><span class="tocnumber">2</span> <span class="toctext">Bond ETFs</span></a></li>, <li class="toclevel-1 tocsection-18"><a href="#Commodity_ETFs"><span class="tocnumber">3</span> <span class="toctext">Commodity ETFs</span></a>
<ul>
<li class="toclevel-2 tocsection-19"><a href="#Broad_basket"><span class="tocnumber">3.1</span> <span class="toctext">Broad basket</span></a></li>
<li class="toclevel-2 tocsection-20"><a href="#Agricultural_ETFs"><span class="tocnumber">3.2</span> <span class="toctext">Agricultural ETFs</span></a></li>
<li class="toclevel-2 tocsection-21"><a href="#Energy_commodity_ETFs"><span class="tocnumber">3.3</span> <span class="toctext">Energy commodity ETFs</span></a></li>
<li class="toclevel-2 tocsection-22"><a href="#Industrial_commodity_ETFs"><span class="tocnumber">3.4</span> <span class="toctext">Industrial commodity ETFs</span></a></li>
<li class="toclevel-2 tocsection-23"><a href="#Precious_metals_ETFs"><span class="tocnumber">3.5</span> <span class="toctext">Precious metals ETFs</span></a></li>
</ul>
</li>, <li class="toclevel-1 tocsection-24"><a href="#Real_estate_ETFs"><span class="tocnumber">4</span> <span class="toctext">Real estate ETFs</span></a></li>, <li class="toclevel-1 tocsection-25"><a href="#Leveraged_&amp;_short_ETFs"><span class="tocnumber">5</span> <span class="toctext">Leveraged &amp; short ETFs</span></a>
<ul>
<li class="toclevel-2 tocsection-26"><a href="#Short_ETFs"><span class="tocnumber">5.1</span> <span class="toctext">Short ETFs</span></a></li>
<li class="toclevel-2 tocsection-27"><a href="#Leveraged_ETFs"><span class="tocnumber">5.2</span> <span class="toctext">Leveraged ETFs</span></a></li>
<li class="toclevel-2 tocsection-28"><a href="#Leveraged_short_ETFs"><span class="tocnumber">5.3</span> <span class="toctext">Leveraged short ETFs</span></a></li>
</ul>
</li>, <li class="toclevel-1 tocsection-29"><a href="#Asset_allocation"><span class="tocnumber">6</span> <span class="toctext">Asset allocation</span></a></li>, <li class="toclevel-1 tocsection-30"><a href="#Active_ETFs"><span class="tocnumber">7</span> <span class="toctext">Active ETFs</span></a></li>, <li class="toclevel-1 tocsection-31"><a href="#See_also"><span class="tocnumber">8</span> <span class="toctext">See also</span></a></li>, <li class="toclevel-1 tocsection-32"><a href="#References"><span class="tocnumber">9</span> <span class="toctext">References</span></a></li>, <li class="toclevel-1 tocsection-33"><a href="#External_links"><span class="tocnumber">10</span> <span class="toctext">External links</span></a></li>, <li>iShares Core S&amp;P Total US Stock Mkt (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:ITOT" rel="nofollow">ITOT</a>)</li>, <li>iShares MSCI ACWI Index (<a href="/wiki/Nasdaq" title="Nasdaq">Nasdaq</a>: <a class="external text" href="https://www.nasdaq.com/symbol/acwi" rel="nofollow">ACWI</a>)</li>, <li>iShares <a class="mw-redirect" href="/wiki/Russell_3000" title="Russell 3000">Russell 3000</a> Index (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:IWV" rel="nofollow">IWV</a>)</li>, <li>Schwab US Broad Market ETF (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:SCHB" rel="nofollow">SCHB</a>)</li>, <li>Schwab Fundamental U.S. Broad Market Index ETF (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:FNDB" rel="nofollow">FNDB</a>)</li>, <li>Vanguard Total World Stock (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:VT" rel="nofollow">VT</a>), tracks the FTSE All-World Index</li>, <li>Vanguard Total Stock Market (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:VTI" rel="nofollow">VTI</a>), tracks the MSCI US Broad Market Index</li>, <li>Vanguard Total International Stock (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:VXUS" rel="nofollow">VXUS</a>), tracks the MSCI All Country World ex-USA Investable Market Index</li>, <li>Vanguard Russell 3000 (<a href="/wiki/NYSE_Arca" title="NYSE Arca">NYSE Arca</a>: <a class="external text" href="https://www.nyse.com/quote/ARCX:VTHR" rel="nofollow">VTHR</a>), tracks 98% of the US market</li>, <li>DIAMONDS Trust, Series 1 (NYSE Arca DIA), tracks the <a href="/wiki/Dow_Jones_Industrial_Average" title="Dow Jones Industrial Average">Dow Jones Industrial Average</a></li>, <li>Guggenheim S&amp;P 500 Equal Weight (NYSE Arca RSP)</li>, <li>iShares S&amp;P Global 100 Index (NYSE Arca IOO), tracks the <a href="/wiki/S%26P_Global_100" title="S&amp;P Global 100">S&amp;P Global 100</a></li>, <li>iShares S&amp;P 500 Index (NYSE Arca IVV), tracks the <a href="/wiki/S%26P_500" title="S&amp;P 500">S&amp;P 500</a></li>, <li>SPDR S&amp;P 500 (NYSE Arca SPY), tracks the <a href="/wiki/S%26P_500" title="S&amp;P 500">S&amp;P 500</a></li>, <li>SPDR Gender Diversity (NYSE Arca | SHE), tracks a <a href="/wiki/Gender_diversity" title="Gender diversity">gender-diverse</a> <a href="/wiki/Gender_representation_on_corporate_boards_of_directors" title="Gender representation on corporate boards of directors">corporate leadership</a> index</li>, <li>Vanguard S&amp;P 500 (NYSE Arca VOO)</li>, <li>iShares Russell 2000 Index (NYSE Arca IWM), tracks the <a class="mw-redirect" href="/wiki/Russell_2000" title="Russell 2000">Russell 2000</a></li>, <li>iShares S&amp;P 100 Index (NYSE Arca OEF), tracks the <a href="/wiki/S%26P_100" title="S&amp;P 100">S&amp;P 100</a></li>, <li>PowerShares QQQ ("cubes") (NASDAQ|QQQ), tracks the <a class="mw-redirect" href="/wiki/NASDAQ-100" title="NASDAQ-100">NASDAQ-100</a></li>, <li>Guggenheim Multi-Asset Income (NYSE Arca CVY)</li>, <li>Guggenheim S&amp;P 500 Pure Growth ETF (NYSE Arca RPG)</li>, <li>Guggenheim S&amp;P 500 Pure Value ETF (NYSE Arca RPV)</li>, <li>iShares <a href="/wiki/Russell_1000_Index" title="Russell 1000 Index">Russell 1000 Index</a> (NYSE Arca IWB)
<ul><li>iShares Russell 1000 Growth Index (NYSE Arca IWF)</li>
<li>iShares Russell 1000 Value Index (NYSE Arca IWD)</li></ul></li>, <li>iShares S&amp;P 500 Index (NYSE Arca IVV)
<ul><li>iShares S&amp;P 500 Growth Index (NYSE Arca IVW)</li>
<li>iShares S&amp;P 500 Value Index (NYSE Arca IVE)</li></ul></li>, <li>PowerShares Buyback Achievers (NYSE Arca PKW)</li>, <li>PowerShares FTSE RAFI US 1000 (NYSE Arca PRF)</li>, <li>PowerShares S&amp;P 500 Low Volatility (NYSE Arca SPLV)</li>, <li>Schwab US Large-Cap ETF (NYSE Arca SCHX)
<ul><li>Schwab US Large-Cap Growth ETF (NYSE Arca SCHG)</li>
<li>Schwab US Large-Cap Value ETF (NYSE Arca SCHV)</li></ul></li>, <li>Schwab US Dividend Equity ETF (NYSE Arca SCHD)</li>, <li>Schwab Fundamental U.S. Large Company Index ETF (NYSE Arca FNDX)</li>, <li>SPDR S&amp;P Dividend ETF (NYSE Arca SDY)</li>, <li>Vanguard S&amp;P 500 (NYSE Arca VOO)
<ul><li>Vanguard S&amp;P 500 Growth (NYSE Arca VOOG)</li>
<li>Vanguard S&amp;P 500 Value (NYSE Arca VOOV)</li></ul></li>, <li>Vanguard Large-Cap (NYSE Arca VV)
<ul><li>Vanguard Growth (NYSE Arca VUG)</li>
<li>Vanguard Value (NYSE Arca VTV)</li></ul></li>, <li>Vanguard Mega-Cap 300 (NYSE Arca MGC)
<ul><li>Vanguard Mega-Cap 300 Growth (NYSE Arca MGK)</li>
<li>Vanguard Mega-Cap 300 Value (NYSE Arca MGV)</li></ul></li>, <li>Vanguard Russell 1000 (NYSE Arca VONE)
<ul><li>Vanguard Russell 1000 Growth (NYSE Arca VONG)</li>
<li>Vanguard Russell 1000 Value (NYSE Arca VONV)</li></ul></li>, <li>Vanguard Dividend Appreciation (NYSE Arca VIG)</li>, <li>Vanguard High Dividend Yield (NYSE Arca VYM)</li>, <li>WisdomTree Dividend ex-Financials (NYSE Arca DTN)</li>, <li>WisdomTree LargeCap Dividend (NYSE Arca DLN)</li>, <li>MidCap SPDR (NYSE Arca MDY)</li>, <li>iShares Select Dividend (NYSE Arca DVY)</li>, <li>iShares Russell Midcap Index (NYSE Arca IWR)
<ul><li>iShares Russell Midcap Growth Index (NYSE Arca IWP)</li>
<li>iShares Russell Midcap Value Index (NYSE Arca IWS)</li></ul></li>, <li>iShares S&amp;P MidCap 400 Index (NYSE Arca IJH)
<ul><li>iShares S&amp;P MidCap 400 Growth Index (NYSE Arca IJK)</li>
<li>iShares S&amp;P MidCap 400 Value Index (NYSE Arca IJJ)</li></ul></li>, <li>PowerShares DWA Mom Port (NYSE Arca PDP)</li>, <li>Schwab US Mid-Cap (NYSE Arca SCHM)</li>, <li>Vanguard S&amp;P Mid-Cap 400 (NYSE Arca IVOO)
<ul><li>Vanguard S&amp;P Mid-Cap 400 Growth (NYSE Arca IVOG)</li>
<li>Vanguard S&amp;P Mid-Cap 400 Value (NYSE Arca IVOV)</li></ul></li>, <li>Vanguard Mid-Cap (NYSE Arca VO)
<ul><li>Vanguard Mid-Cap Growth (NYSE Arca VOT)</li>
<li>Vanguard Mid-Cap Value (NYSE Arca VOE)</li></ul></li>, <li>Vanguard Extended Market (NYSE Arca VXF), tracks the S&amp;P Completion Index, i.e., S&amp;P Total Market Index minus the S&amp;P 500 Index</li>, <li>WisdomTree MidCap Dividend ETF (NYSE Arca DON)</li>, <li>iShares Micro-Cap (NYSE Arca IWC)</li>, <li>iShares <a href="/wiki/Russell_2000_Index" title="Russell 2000 Index">Russell 2000 Index</a> (NYSE Arca IWM)
<ul><li>iShares Russell 2000 Growth Index (NYSE Arca IWO)</li>
<li>iShares Russell 2000 Value Index (NYSE Arca IWN)</li></ul></li>, <li>iShares S&amp;P SmallCap 600 Index (NYSE Arca IJR)
<ul><li>iShares S&amp;P SmallCap 600 Growth Index (NYSE Arca IJT)</li>
<li>iShares S&amp;P SmallCap 600 Value Index (NYSE Arca IJS)</li></ul></li>, <li>Schwab US Small-Cap ETF (NYSE Arca SCHA)</li>, <li>Schwab Fundamental U.S. Small Company Index ETF (NYSE Arca FNDA)</li>, <li>Vanguard S&amp;P Small-Cap 600 (NYSE Arca VIOO)
<ul><li>Vanguard S&amp;P Small-Cap 600 Growth (NYSE Arca VIOG)</li>
<li>Vanguard S&amp;P Small-Cap 600 Value (NYSE Arca VIOV)</li></ul></li>, <li>Vanguard Small-Cap (NYSE Arca VB)
<ul><li>Vanguard Small-Cap Growth (NYSE Arca VBK)</li>
<li>Vanguard Small-Cap Value (NYSE Arca VBR)</li></ul></li>, <li>Vanguard Russell 2000 (NYSE Arca VTWO)
<ul><li>Vanguard Russell 2000 Growth (NYSE Arca VTWG)</li>
<li>Vanguard Russell 2000 Value (NYSE Arca VTWV)</li></ul></li>, <li>Claymore/BNY BRIC (NYSE Arca EEB)</li>, <li>EGShares Emerging Markets Consumer (NYSE Arca ECON)</li>, <li>iShares International Select Div (NYSE Arca IDV)</li>, <li>iShares MSCI ACWI ex US Index (NASDAQ|ACWX)</li>, <li>iShares MSCI BRIC Index (NYSE Arca BKF)</li>, <li>iShares <a href="/wiki/MSCI_EAFE" title="MSCI EAFE">MSCI EAFE</a> Index (NYSE Arca EFA)
<ul><li>iShares MSCI EAFE Growth Index (NYSE Arca EFG)</li>

In [89]:
etfs = {}

for row in rows :
#     print(row.text)
#     print('*' * 100)
    
    etf_name = re.findall('^(.*) \(NYSE' , row.text) 
    # print('etf_name - ' , etf_name)
    
    etf_market = re.findall('\((.*)\|' , row.text) 
    # print('etf_market - ' , etf_market)
    
    if ( (len(etf_name) > 0 ) & (len(etf_market) > 0 ) ) :
        etfs[ etf_name[0] ] = [ etf_name[0] , etf_market[0] ]

In [90]:
etfs

{'SPDR Gender Diversity': ['SPDR Gender Diversity', 'NYSE Arca ']}

In [91]:
tmp_frm = pd.DataFrame(efts)
tmp_frm

   SPDR Gender Diversity
0  SPDR Gender Diversity
1             NYSE Arca

- google 지오코딩 API
- conda install -c conda-forge googlemaps
- 코랩
- !pip install -U  googlemaps

In [94]:
import googlemaps

In [96]:
my_key = '발급받은 API 키 입력'

maps = googlemaps.Client(key = 'AIzaSyBu-5obPaXczZKRleHqIAlYctTx1oKEtB0')

In [122]:
maps.geocode('대전국립현충원')[0].get('geometry')

{'location': {'lat': 36.3686021, 'lng': 127.296685},
 'location_type': 'ROOFTOP',
 'viewport': {'northeast': {'lat': 36.3699510802915, 'lng': 127.2980339802915},
  'southwest': {'lat': 36.3672531197085, 'lng': 127.2953360197085}}}

In [123]:
print('아래 지역에 대한 위도, 경도를 이용한 데이터 프레임 작성 [실습] - ')
print('지역이름을 인덱스로 활용 - ')
print()
places = ['서울시청' , '해운대해수욕장' , '대전국립현충원' , '청와대' , '인천공항']

아래 지역에 대한 위도, 경도를 이용한 데이터 프레임 작성 [실습] -
지역이름을 인덱스로 활용 -

In [124]:
lat = []
lng = []

for place in places :
    location = maps.geocode(place)[0].get('geometry')
    print('location - ' , location['location'])
    lat.append(location['location']['lat'])
    lng.append(location['location']['lng'])

print('lat - ' , lat)
print('lng - ' , lng)

location -  {'lat': 37.5662952, 'lng': 126.9779451}
location -  {'lat': 35.1586975, 'lng': 129.1603842}
location -  {'lat': 36.3686021, 'lng': 127.296685}
location -  {'lat': 37.5866076, 'lng': 126.974811}
location -  {'lat': 37.4562557, 'lng': 126.7052062}
lat -  [37.5662952, 35.1586975, 36.3686021, 37.5866076, 37.4562557]
lng -  [126.9779451, 129.1603842, 127.296685, 126.974811, 126.7052062]

In [125]:
tmp_frm = pd.DataFrame({'위도' : lat , '경도' : lng} , 
                       index = places)
tmp_frm

                위도          경도
서울시청     37.566295  126.977945
해운대해수욕장  35.158698  129.160384
대전국립현충원  36.368602  127.296685
청와대      37.586608  126.974811
인천공항     37.456256  126.705206

In [130]:
tmp_frm.to_csv('./pandas_data/googlemap_frm.csv')

In [129]:
tmp_frm = pd.read_csv('./pandas_data/googlemap_frm.csv')
tmp_frm.set_index('Unnamed: 0')

                   위도          경도
Unnamed: 0
서울시청        37.566295  126.977945
해운대해수욕장     35.158698  129.160384
대전국립현충원     36.368602  127.296685
청와대         37.586608  126.974811
인천공항        37.456256  126.705206

- court_code.txt

In [135]:
court_frm = pd.read_csv('./pandas_data/court_code.txt' , sep='\t' , encoding='cp949')
frmInfo( court_frm )

'data - '

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46175  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46176  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46177  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46178  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46179  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[46180 rows x 3 columns]

shape   -  (46180, 3) 46180 3
size    -  138540
ndim    -  2
index   -  RangeIndex(start=0, stop=46180, step=1) <class 'pandas.core.indexes.range.RangeIndex'>
columns -  Index(['법정동코드', '법정동명', '폐지여부'], dtype='object') <class 'pandas.core.indexes.base.Index'>
values  -
 [[1100000000 '서울특별시' '존재']
 [1111000000 '서울특별시 종로구' '존재']
 [1111010100 '서울특별시 종로구 청운동' '존재']
 ...
 [5013032024 '제주특별자치도 서귀포시 표선면 가시리' '존재']
 [5013032025 '제주특별자치도 서귀포시 표선면 세화리' '존재']
 [5013032026 '제주특별자치도 서귀포시 표선면 토산리' '존재']] <class 'numpy.ndarray'>

In [136]:
court_frm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46180 entries, 0 to 46179
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   법정동코드   46180 non-null  int64
 1   법정동명    46180 non-null  object
 2   폐지여부    46180 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [139]:
court_frm.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [148]:
print('폐지여부가 존재인것들만 subset 으로 만들어본다면? - ') 

# court_frm['폐지여부'].value_counts()
boolean_idx = court_frm['폐지여부'] == '존재'

court_exist_frm = court_frm[boolean_idx] 
# court_exits_frm['폐지여부'].value_counts()
court_exist_frm

폐지여부가 존재인것들만 subset 으로 만들어본다면? -

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46175  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46176  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46177  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46178  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46179  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[20544 rows x 3 columns]

In [150]:
print('str 이용해서 문자열 처리가 가능 - ')
print('type - ' , type(court_exist_frm['법정동명'].str))

str 이용해서 문자열 처리가 가능 -
type -  <class 'pandas.core.strings.accessor.StringMethods'>

In [172]:
print('힌트 - ')
court_exist_frm['법정동명'].str.split(" " , expand = True).head()

       0     1     2     3     4
0  서울특별시  None  None  None  None
1  서울특별시   종로구  None  None  None
2  서울특별시   종로구   청운동  None  None
3  서울특별시   종로구   신교동  None  None
4  서울특별시   종로구   궁정동  None  None

In [176]:
print('서울로 시작하는 데이터만 필터링 한다면 - ')

court_exist_frm[ court_exist_frm['법정동명'].str.startswith('서울') ]

서울로 시작하는 데이터만 필터링 한다면 -

           법정동코드           법정동명 폐지여부
0     1100000000          서울특별시   존재
1     1111000000      서울특별시 종로구   존재
2     1111010100  서울특별시 종로구 청운동   존재
3     1111010200  서울특별시 종로구 신교동   존재
4     1111010300  서울특별시 종로구 궁정동   존재
...          ...            ...  ...
1107  1174010600  서울특별시 강동구 둔촌동   존재
1108  1174010700  서울특별시 강동구 암사동   존재
1109  1174010800  서울특별시 강동구 성내동   존재
1110  1174010900  서울특별시 강동구 천호동   존재
1111  1174011000  서울특별시 강동구 강일동   존재

[493 rows x 3 columns]

In [177]:
print('동으로 끝나는 데이터만 필터링 한다면   - ')
court_exist_frm[ court_exist_frm['법정동명'].str.endswith('동') ]

동으로 끝나는 데이터만 필터링 한다면   -

            법정동코드              법정동명 폐지여부
2      1111010100     서울특별시 종로구 청운동   존재
3      1111010200     서울특별시 종로구 신교동   존재
4      1111010300     서울특별시 종로구 궁정동   존재
5      1111010400     서울특별시 종로구 효자동   존재
6      1111010500     서울특별시 종로구 창성동   존재
...           ...               ...  ...
46119  5013011800  제주특별자치도 서귀포시 하원동   존재
46120  5013011900  제주특별자치도 서귀포시 색달동   존재
46121  5013012000  제주특별자치도 서귀포시 상예동   존재
46122  5013012100  제주특별자치도 서귀포시 하예동   존재
46123  5013012200  제주특별자치도 서귀포시 영남동   존재

[3205 rows x 3 columns]

In [178]:
print('서울이고 강서구만 필터링 한다면 - ') 
court_exist_frm[  court_exist_frm['법정동명'].str.contains('서울') & court_exist_frm['법정동명'].str.contains('강서구') ]

서울이고 강서구만 필터링 한다면 -

          법정동코드            법정동명 폐지여부
737  1150000000       서울특별시 강서구   존재
740  1150010100   서울특별시 강서구 염창동   존재
741  1150010200   서울특별시 강서구 등촌동   존재
742  1150010300   서울특별시 강서구 화곡동   존재
743  1150010400   서울특별시 강서구 가양동   존재
744  1150010500   서울특별시 강서구 마곡동   존재
745  1150010600  서울특별시 강서구 내발산동   존재
746  1150010700  서울특별시 강서구 외발산동   존재
747  1150010800   서울특별시 강서구 공항동   존재
748  1150010900   서울특별시 강서구 방화동   존재
749  1150011000   서울특별시 강서구 개화동   존재
750  1150011100   서울특별시 강서구 과해동   존재
751  1150011200   서울특별시 강서구 오곡동   존재
752  1150011300   서울특별시 강서구 오쇠동   존재

- weather_20201012.csv

In [182]:
weather_frm = pd.read_csv('./pandas_data/weather_20201012.csv' , encoding = 'cp949')
frmInfo( weather_frm )

'data - '

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
0      1907-10-01  108     13.5      7.9     20.7
1      1907-10-02  108     16.2      7.9     22.0
2      1907-10-03  108     16.2     13.1     21.3
3      1907-10-04  108     16.5     11.2     22.0
4      1907-10-05  108     17.6     10.9     25.4
...           ...  ...      ...      ...      ...
40849  2020-10-07  108     16.0      9.9     22.0
40850  2020-10-08  108     17.2     12.1     23.1
40851  2020-10-09  108     17.2     12.4     23.3
40852  2020-10-10  108     16.9     12.3     21.5
40853  2020-10-11  108     16.9     12.7     20.8

[40854 rows x 5 columns]

shape   -  (40854, 5) 40854 5
size    -  204270
ndim    -  2
index   -  RangeIndex(start=0, stop=40854, step=1) <class 'pandas.core.indexes.range.RangeIndex'>
columns -  Index(['날짜', '지점', '평균기온(℃)', '최저기온(℃)', '최고기온(℃)'], dtype='object') <class 'pandas.core.indexes.base.Index'>
values  -
 [['1907-10-01' 108 13.5 7.9 20.7]
 ['1907-10-02' 108 16.2 7.9 22.0]
 ['1907-10-03' 108 16.2 13.1 21.3]
 ...
 ['2020-10-09' 108 17.2 12.4 23.3]
 ['2020-10-10' 108 16.9 12.3 21.5]
 ['2020-10-11' 108 16.9 12.7 20.8]] <class 'numpy.ndarray'>

In [190]:
print('기온이 가장 높았던 데이터를 출력 - (데이터프레임형식으로)')
print('sort_values - ')
print()
print('case01 - ')
display( weather_frm.sort_values(by='최고기온(℃)' , ascending = False).iloc[[0]] )

print()
print('case02 - ')
display( weather_frm[ weather_frm['최고기온(℃)'] ==  weather_frm['최고기온(℃)'].max() ] )

기온이 가장 높았던 데이터를 출력 - (데이터프레임형식으로)
sort_values -

case01 -

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
40051  2018-08-01  108     33.6     27.8     39.6

case02 -

               날짜   지점  평균기온(℃)  최저기온(℃)  최고기온(℃)
40051  2018-08-01  108     33.6     27.8     39.6

- 데이터 프레임을 가지고 행, 열 단위의 데이터 가공해야하는 경우
- apply()
- 람다식

In [191]:
tmp_frm = pd.DataFrame( np.random.randint(10, size=(4,8)))
tmp_frm

   0  1  2  3  4  5  6  7
0  1  8  8  4  4  1  9  8
1  6  2  2  6  3  2  1  3
2  8  7  8  5  7  2  5  8
3  8  5  1  0  8  8  5  4

In [195]:
tmp_frm.sum(axis = 1 )

0    43
1    25
2    50
3    39
dtype: int64

In [196]:
tmp_frm['row_sum'] = tmp_frm.sum(axis = 1 )
tmp_frm

   0  1  2  3  4  5  6  7  row_sum
0  1  8  8  4  4  1  9  8       43
1  6  2  2  6  3  2  1  3       25
2  8  7  8  5  7  2  5  8       50
3  8  5  1  0  8  8  5  4       39

In [198]:
tmp_frm.loc['col_sum' , : ]  = tmp_frm.sum(axis = 0 )
tmp_frm

            0     1     2     3     4     5     6     7  row_sum
0         1.0   8.0   8.0   4.0   4.0   1.0   9.0   8.0     43.0
1         6.0   2.0   2.0   6.0   3.0   2.0   1.0   3.0     25.0
2         8.0   7.0   8.0   5.0   7.0   2.0   5.0   8.0     50.0
3         8.0   5.0   1.0   0.0   8.0   8.0   5.0   4.0     39.0
col_sum  23.0  22.0  19.0  15.0  22.0  13.0  20.0  23.0    157.0

In [199]:
def get_square(a) :
    return a ** 2

In [200]:
print(' - ' , get_square(2))

 -  4

In [201]:
print('lambda - ') 
lambda_square = lambda a : a ** 2
print(' - ' , lambda_square(3) )

lambda -
 -  9

In [212]:
tmp_frm = pd.DataFrame( np.random.randint(10, size=(6,4)))
tmp_frm

   0  1  2  3
0  9  9  8  0
1  3  7  2  8
2  3  5  3  9
3  3  2  7  2
4  7  0  7  8
5  5  4  1  4

In [213]:
tmp_frm.columns = ['A' , 'B' , 'C' , 'D' ] 
tmp_frm.index   = pd.date_range('20220329' , periods = 6) 
tmp_frm

            A  B  C  D
2022-03-29  9  9  8  0
2022-03-30  3  7  2  8
2022-03-31  3  5  3  9
2022-04-01  3  2  7  2
2022-04-02  7  0  7  8
2022-04-03  5  4  1  4

In [214]:
print('각 행에 대해서 최대값 - 최소값을 구해서 새로운 열을 추가한다면? - ') 
print('lambda - ')

tmp_frm['max - min'] = tmp_frm.apply(lambda frm : frm.max() - frm.min() , axis = 1)
tmp_frm

각 행에 대해서 최대값 - 최소값을 구해서 새로운 열을 추가한다면? -
lambda -

            A  B  C  D  max - min
2022-03-29  9  9  8  0          9
2022-03-30  3  7  2  8          6
2022-03-31  3  5  3  9          6
2022-04-01  3  2  7  2          5
2022-04-02  7  0  7  8          8
2022-04-03  5  4  1  4          4

In [215]:
tmp_frm.loc['2022-04-04' , : ] = tmp_frm.apply(lambda frm : frm.max() - frm.min() , axis = 0)
tmp_frm

              A    B    C    D  max - min
2022-03-29  9.0  9.0  8.0  0.0        9.0
2022-03-30  3.0  7.0  2.0  8.0        6.0
2022-03-31  3.0  5.0  3.0  9.0        6.0
2022-04-01  3.0  2.0  7.0  2.0        5.0
2022-04-02  7.0  0.0  7.0  8.0        8.0
2022-04-03  5.0  4.0  1.0  4.0        4.0
2022-04-04  6.0  9.0  7.0  9.0        5.0

In [216]:
datasets = sns.load_dataset('titanic')
datasets.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [219]:
print('age를 기준으로 성인과 미성년자를 구별하는 열을 추가한다면?')
print('adult/child - 20 >= 성인 ')
print('apply lambda 활용해서 - ')
'''
lambda 인수 : 실행문 
lambda frm  : True if 조건 else False 
'''
datasets['adult/child'] = datasets.apply(lambda frm : '성인' if (frm['age'] >= 20) else '미성년자' , axis = 1)
datasets

age를 기준으로 성인과 미성년자를 구별하는 열을 추가한다면?
adult/child - 20 >= 성인
apply lambda 활용해서 -

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,성인
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,성인
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,성인
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,성인
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,성인
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,성인
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,미성년자
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,성인
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,성인

In [221]:
print('category 열 추가하고 싶다 - ') 
print('age를 기준으로 20살이 넘으면 성별을 그대로 사용하고 그렇지 않으면 성별에 상관없이 미성년자로 - ')
datasets['category'] = datasets.apply(lambda frm: frm['sex'] if (frm['age']>=20) else '미성년자', axis =1)
datasets

category 열 추가하고 싶다 -
age를 기준으로 20살이 넘으면 성별을 그대로 사용하고 그렇지 않으면 성별에 상관없이 미성년자로 -

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,성인,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,성인,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,성인,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,성인,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,성인,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,성인,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자,미성년자
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,미성년자,미성년자
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,성인,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,성인,male

In [226]:
print('embark_town의 문자열 갯수를 별도의 컬럼인 embark_len 으로 추가하고 싶다면? - ') 
# datasets['embark_len'] = datasets.apply(lambda frm : len(str( frm['embark_town']) ) , axis =1)
# datasets

datasets['embark_len'] = datasets['embark_town'].apply(lambda frm : len( str( frm ) ))
datasets

embark_town의 문자열 갯수를 별도의 컬럼인 embark_len 으로 추가하고 싶다면? -

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category,embark_len
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,성인,male,11
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,성인,female,9
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,성인,female,11
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,성인,female,11
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,성인,male,11
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,성인,male,11
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자,미성년자,11
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,미성년자,미성년자,11
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,성인,male,9
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,성인,male,10

In [223]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 17 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  adult/child  891 non-null    object
 16  category     891 non-null    object
dtypes: bool(2), category(2), float64(2), int64(4), object(7)
memory usage: 94.6+ KB

- 결측값을 원하는 값으로 채워 넣을 때 사용하는 fillna()

In [229]:
tmp_frm = pd.DataFrame( np.random.randint(10, size=(6,4)))

tmp_frm.columns = ['A' , 'B' , 'C' , 'D' ] 
tmp_frm.index   = pd.date_range('20220329' , periods = 6) 
tmp_frm.iloc[1 , 2] = np.NaN
tmp_frm.iloc[3 , 0] = np.NaN

tmp_frm

              A  B    C  D
2022-03-29  6.0  4  7.0  4
2022-03-30  9.0  5  NaN  4
2022-03-31  6.0  9  6.0  7
2022-04-01  NaN  8  0.0  8
2022-04-02  0.0  3  7.0  1
2022-04-03  2.0  3  3.0  1

In [231]:
tmp_frm.fillna(0).astype(int)

            A  B  C  D
2022-03-29  6  4  7  4
2022-03-30  9  5  0  4
2022-03-31  6  9  6  7
2022-04-01  0  8  0  8
2022-04-02  0  3  7  1
2022-04-03  2  3  3  1

In [233]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  adult/child  891 non-null    object
 16  category     891 non-null    object
 17  embark_len   891 non-null    int64
dtypes: bool(2), category(2), float64(2), int64(5), object(7)
memory usage: 101.5+ KB

In [235]:
datasets.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
adult/child      0
category         0
embark_len       0
dtype: int64

In [245]:
datasets.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
adult/child      0
category         0
embark_len       0
dtype: int64

In [237]:
datasets.describe()

,survived,pclass,age,sibsp,parch,fare,embark_len
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,10.518519
std,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.867933
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,3.000000
25%,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,10.000000
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,11.000000
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,11.000000
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,11.000000

In [240]:
print('승객 중에서 나이를 명시하지 않는 고객의 나이를 평균 나이값으로 대체한다면? - ')
print()

datasets['age'] = datasets['age'].fillna( datasets['age'].mean() )

승객 중에서 나이를 명시하지 않는 고객의 나이를 평균 나이값으로 대체한다면? -

In [241]:
datasets['age'].isnull().sum()

0

In [242]:
datasets

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category,embark_len
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,성인,male,11
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,성인,female,9
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,성인,female,11
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,성인,female,11
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,성인,male,11
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,성인,male,11
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자,미성년자,11
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,미성년자,미성년자,11
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,성인,male,9
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,성인,male,10

In [246]:
print('age_gender_category - 추가')
print('조건 1) 성별(male | female)')
print('조건 2) 성별을 나타내는 문자열 뒤에 나이를 추가하고 싶다')
print('예시) male27')

datasets ['age_gender_category'] = datasets.apply(lambda frm : frm['sex'] + str(frm['age']), axis = 1)
datasets

age_gender_category - 추가
조건 1) 성별(male | female)
조건 2) 성별을 나타내는 문자열 뒤에 나이를 추가하고 싶다
예시) male27

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category,embark_len,age_gender_category
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,성인,male,11,male22.0
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,성인,female,9,female38.0
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,성인,female,11,female26.0
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,성인,female,11,female35.0
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,성인,male,11,male35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,성인,male,11,male27.0
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,미성년자,미성년자,11,female19.0
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,미성년자,미성년자,11,female29.69911764705882
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,성인,male,9,male26.0
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,성인,male,10,male32.0

In [247]:
print('승객에 대한 나이와 성별에 따른 age_gender 추가 - ') 
print('조건 1) 20살이 넘으면 성별을 그대로 사용하고')
print("조건 2) 20살 미만이면 성별에 관계없이 child라고 정의하고 결측값이 있는 경우 i don't know 정의한다" )

datasets.iloc[[1,3,5,7,9],3] = np.NaN

datasets['age_gender'] = datasets.apply( lambda frm: frm['sex'] if frm['age'] >= 20 
                                                                 else 'child' if frm['age'] < 20 
                                                                 else "I don't know", axis = 1)
datasets['age_gender'].value_counts()

승객에 대한 나이와 성별에 따른 age_gender 추가 -
조건 1) 20살이 넘으면 성별을 그대로 사용하고
조건 2) 20살 미만이면 성별에 관계없이 child라고 정의하고 결측값이 있는 경우 i don't know 정의한다

male            487
female          237
child           162
I don't know      5
Name: age_gender, dtype: int64